---
kind: type
id: T:Autodesk.Revit.DB.ElementArray
source: html/6a3046e5-aad4-f1fa-b733-bfd57bc9cbc5.htm
---
# Autodesk.Revit.DB.ElementArray

An array that contains element objects.

## Syntax (C#)
```csharp
public class ElementArray : APIObject,
	IEnumerable
```